Revit 2027 API
BuiltInFailures.SiteFailures.SiteEditPointsInvisible Property
 Topographic elements are not visible in your current view. You can modify View Range settings in the view's Properties or Visibility settings in Visibility/Graphics. It is often easier to edit topography in a Site view or a 3D view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SiteEditPointsInvisible { get; }
Public Shared ReadOnly Property SiteEditPointsInvisible As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SiteEditPointsInvisible {
	FailureDefinitionId^ get ();
}
static member SiteEditPointsInvisible : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace